arnoutzw/esp32-rover/firmware/sdkconfig.defaults.ttgo
# TTGO T-Display Rover SDK Configuration
# Use this configuration for TTGO T-Display module (no camera)

# Target ESP32
CONFIG_IDF_TARGET="esp32"

# Flash size (4MB for TTGO T-Display)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM support - TTGO T-Display does NOT have PSRAM
# Explicitly disabled to prevent boot failures
CONFIG_ESP32_SPIRAM_SUPPORT=n
CONFIG_SPIRAM=n

# Camera support - disabled for TTGO T-Display
# CONFIG_CAMERA_CORE0 is not set

# WiFi
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y

# HTTP Server - memory optimized for TTGO
# Reduced buffer sizes to save RAM
CONFIG_HTTPD_MAX_REQ_HDR_LEN=512
CONFIG_HTTPD_MAX_URI_LEN=256
CONFIG_HTTPD_MAX_OPEN_SOCKETS=4

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_USE_TRACE_FACILITY=y

# LWIP - memory optimized for TTGO
# Reduced socket count to save RAM (~400 bytes per socket)
CONFIG_LWIP_MAX_SOCKETS=8

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Disable WiFi NVS to prevent mode override issues
CONFIG_ESP_WIFI_NVS_ENABLED=n

# Task Watchdog - disable auto init (we init manually in app)
CONFIG_ESP_TASK_WDT_INIT=n

# OTA Rollback Support - DISABLED for TTGO due to IRAM constraints
# TTGO T-Display has no PSRAM, very tight IRAM budget
# ESP32-CAM has this enabled (has PSRAM)
# CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE is not set

# MQTT - memory optimized for TTGO
# Use custom config to reduce buffer sizes
CONFIG_MQTT_USE_CUSTOM_CONFIG=y
CONFIG_MQTT_BUFFER_SIZE=1024
CONFIG_MQTT_TASK_STACK_SIZE=4096

# Disable unused MQTT transports to save flash/RAM
CONFIG_MQTT_TRANSPORT_SSL=n
CONFIG_MQTT_TRANSPORT_WEBSOCKET=n

# IRAM optimization - move non-ISR code to flash to free up IRAM
CONFIG_FREERTOS_PLACE_FUNCTIONS_INTO_FLASH=y
CONFIG_FREERTOS_PLACE_SNAPSHOT_FUNS_INTO_FLASH=y
CONFIG_RINGBUF_PLACE_FUNCTIONS_INTO_FLASH=y
CONFIG_RINGBUF_PLACE_ISR_FUNCTIONS_INTO_FLASH=y
CONFIG_HAL_DEFAULT_ASSERTION_LEVEL=1
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_SPI_FLASH_ROM_DRIVER_PATCH=y
CONFIG_ESP_EVENT_POST_FROM_ISR=n
CONFIG_LWIP_IRAM_OPTIMIZATION=n
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n
CONFIG_SPI_MASTER_ISR_IN_IRAM=n
CONFIG_SPI_SLAVE_ISR_IN_IRAM=n
CONFIG_GPTIMER_ISR_HANDLER_IN_IRAM=n
CONFIG_HEAP_PLACE_FUNCTION_INTO_FLASH=y
